---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionShapeName
source: html/9d2eed14-e1cc-2241-d01d-72f3ba092cf4.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionShapeName Property

A human readable string representing the structural section shape.

## Syntax (C#)
```csharp
public string StructuralSectionShapeName { get; }
```